chacal/arduino/nrf5-ina226-sensor/src/vcc_measurement.c
#include "vcc_measurement.h"
#include <app_error.h>
#include <app_timer.h>
#include <nrf_drv_saadc.h>

static vcc_measurement_cb_t m_measurement_cb;
static uint8_t              m_adc_channel = 0;

static void sample_vcc(void *ctx) {
  nrf_saadc_value_t value;
  nrf_drv_saadc_sample_convert(m_adc_channel, &value);
  uint16_t vcc = (uint16_t) (value / (float) 4095 * 6 * 0.6 * 1000);  // ADC value (12-bit) * prescale (1/6) * 0.6V reference * mV
  m_measurement_cb(vcc);
}

static void on_adc_event(nrf_drv_saadc_evt_t const *event) {}

static void adc_init() {
  nrf_drv_saadc_config_t config = NRF_DRV_SAADC_DEFAULT_CONFIG;
  APP_ERROR_CHECK(nrf_drv_saadc_init(&config, on_adc_event));

  nrf_saadc_channel_config_t channel_config = NRF_DRV_SAADC_DEFAULT_CHANNEL_CONFIG_SE(NRF_SAADC_INPUT_VDD);
  channel_config.burst = NRF_SAADC_BURST_ENABLED;
  APP_ERROR_CHECK(nrf_drv_saadc_channel_init(m_adc_channel, &channel_config));
}


void vcc_measurement_init(uint32_t measurement_interval_ms, vcc_measurement_cb_t callback) {
  m_measurement_cb = callback;
  adc_init();

  APP_TIMER_DEF(adc_timer);
  app_timer_create(&adc_timer, APP_TIMER_MODE_REPEATED, sample_vcc);
  app_timer_start(adc_timer, APP_TIMER_TICKS(measurement_interval_ms), NULL);

  sample_vcc(NULL);
}
